Andre-Wa/p4da-v1/sdkconfig.defaults
# --- Target ---
CONFIG_IDF_TARGET="esp32p4"

# --- PSRAM (32MB HEX) ---
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM=y   # renomeado no IDF 5.5

# --- Banda/perf p/ MIPI-DSI ---
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# --- Flash (16MB) + partições ---
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- SD card (nomes longos + UTF-8 p/ acentos) ---
# Nota: no IDF 5.5 "FATFS_LONG_FILENAMES" virou choice; o membro válido é
# FATFS_LFN_HEAP. A linha antiga era ignorada com warning no configure.
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_API_ENCODING_UTF_8=y

# --- USB-OTG (host p/ teclado) ---
CONFIG_USB_HOST_CONTROL_TRANSFER_MAX_SIZE=256
CONFIG_USB_OTG_SUPPORTED=y

# --- LCD ---
CONFIG_LCD_ENABLE_DEBUG_LOG=n

# --- FreeRTOS / tarefas ---
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# --- Power management (standby/light sleep — ver docs/POWER.md) ---
CONFIG_PM_ENABLE=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y

# --- C++ (Slint) ---
CONFIG_COMPILER_CXX_EXCEPTIONS=y
CONFIG_COMPILER_CXX_RTTI=y
